<?xml version="1.0" ?>
<net name="Extracted from {tf2onnx}" version="11">
	<layers>
		<layer id="0" name="sequential/mobilenetv2_1.00_160/Conv1/Conv2D__6:0" type="Parameter" version="opset1">
			<data shape="?,3,160,160" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/Conv1/Conv2D__6:0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/Conv1/Conv2D__6:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="sequential/mobilenetv2_1.00_160/Conv1/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="0" size="3456"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/Conv1/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/Conv1/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convolution_132" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_132"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Reshape_152" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3456" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="sequential/mobilenetv2_1.00_160/bn_Conv1/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_151, Reshape_152, sequential/mobilenetv2_1.00_160/bn_Conv1/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/bn_Conv1/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="sequential/mobilenetv2_1.00_160/Conv1_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_180, sequential/mobilenetv2_1.00_160/Conv1_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/Conv1_relu/Relu6:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_189" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3584" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="GroupConvolution_255" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_255, Reshape_189"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_275" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4736" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="sequential/mobilenetv2_1.00_160/expanded_conv_depthwise_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_274, Reshape_275, sequential/mobilenetv2_1.00_160/expanded_conv_depthwise_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/expanded_conv_depthwise_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="sequential/mobilenetv2_1.00_160/expanded_conv_depthwise_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_303, sequential/mobilenetv2_1.00_160/expanded_conv_depthwise_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/expanded_conv_depthwise_relu/Relu6:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="sequential/mobilenetv2_1.00_160/expanded_conv_project/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="4864" size="2048"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/expanded_conv_project/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/expanded_conv_project/Conv2D_weights_fused_bn">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Convolution_305" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_305"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_325" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="6912" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="sequential/mobilenetv2_1.00_160/expanded_conv_project_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_324, Reshape_325, sequential/mobilenetv2_1.00_160/expanded_conv_project_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/expanded_conv_project_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Multiply_8546" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="6976" size="6144"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Multiply_8490" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_1_expand/Conv2D:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp_1:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/ReadVariableOp_1:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_8495" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="13120" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp_1:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_1_expand_BN/ReadVariableOp_1:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_1_expand_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="sequential/mobilenetv2_1.00_160/block_1_expand_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_356, sequential/mobilenetv2_1.00_160/block_1_expand_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_1_expand_relu/Relu6:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_369" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="13504" size="3456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="GroupConvolution_435" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_435, Reshape_369, sequential/mobilenetv2_1.00_160/block_1_pad/Pad:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_455" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="16960" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="sequential/mobilenetv2_1.00_160/block_1_depthwise_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_454, Reshape_455, sequential/mobilenetv2_1.00_160/block_1_depthwise_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_1_depthwise_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="sequential/mobilenetv2_1.00_160/block_1_depthwise_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_483, sequential/mobilenetv2_1.00_160/block_1_depthwise_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_1_depthwise_relu/Relu6:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="sequential/mobilenetv2_1.00_160/block_1_project/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="17344" size="9216"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_1_project/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_1_project/Conv2D_weights_fused_bn">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Convolution_485" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_485"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Reshape_505" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="26560" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="sequential/mobilenetv2_1.00_160/block_1_project_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_504, Reshape_505, sequential/mobilenetv2_1.00_160/block_1_project_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_1_project_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Multiply_8555" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="26656" size="13824"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_8497" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_2_expand/Conv2D:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp_1:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/ReadVariableOp_1:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_8502" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="40480" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp_1:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_2_expand_BN/ReadVariableOp_1:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_2_expand_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="sequential/mobilenetv2_1.00_160/block_2_expand_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_536, sequential/mobilenetv2_1.00_160/block_2_expand_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_2_expand_relu/Relu6:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_545" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="41056" size="5184"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="GroupConvolution_611" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_611, Reshape_545"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_631" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="46240" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="sequential/mobilenetv2_1.00_160/block_2_depthwise_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_630, Reshape_631, sequential/mobilenetv2_1.00_160/block_2_depthwise_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_2_depthwise_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="sequential/mobilenetv2_1.00_160/block_2_depthwise_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_659, sequential/mobilenetv2_1.00_160/block_2_depthwise_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_2_depthwise_relu/Relu6:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="sequential/mobilenetv2_1.00_160/block_2_project/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="46816" size="13824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_2_project/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_2_project/Conv2D_weights_fused_bn">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Convolution_661" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_661"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_681" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="60640" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="sequential/mobilenetv2_1.00_160/block_2_project_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_680, Reshape_681, sequential/mobilenetv2_1.00_160/block_2_project_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_2_project_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="sequential/mobilenetv2_1.00_160/block_2_add/add:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_2_add/add:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_2_add/add:0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="sequential/mobilenetv2_1.00_160/block_3_expand/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="60736" size="13824"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_3_expand/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_3_expand/Conv2D_weights_fused_bn">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Convolution_710" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_710"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_730" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="74560" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="sequential/mobilenetv2_1.00_160/block_3_expand_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_729, Reshape_730, sequential/mobilenetv2_1.00_160/block_3_expand_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_3_expand_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="sequential/mobilenetv2_1.00_160/block_3_expand_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_758, sequential/mobilenetv2_1.00_160/block_3_expand_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_3_expand_relu/Relu6:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_771" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="75136" size="5184"/>
			<output>
				<port id="0" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="GroupConvolution_837" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_837, Reshape_771, sequential/mobilenetv2_1.00_160/block_3_pad/Pad:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_857" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="80320" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="sequential/mobilenetv2_1.00_160/block_3_depthwise_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_856, Reshape_857, sequential/mobilenetv2_1.00_160/block_3_depthwise_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_3_depthwise_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="sequential/mobilenetv2_1.00_160/block_3_depthwise_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_885, sequential/mobilenetv2_1.00_160/block_3_depthwise_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_3_depthwise_relu/Relu6:0">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="sequential/mobilenetv2_1.00_160/block_3_project/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="80896" size="18432"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_3_project/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_3_project/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Convolution_887" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_887"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>144</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_907" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="99328" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="sequential/mobilenetv2_1.00_160/block_3_project_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_906, Reshape_907, sequential/mobilenetv2_1.00_160/block_3_project_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_3_project_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Multiply_8564" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="99456" size="24576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_8504" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_4_expand/Conv2D:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp_1:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/ReadVariableOp_1:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_8509" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="124032" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp_1:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/ReadVariableOp:0, sequential/mobilenetv2_1.00_160/block_4_expand_BN/ReadVariableOp_1:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_4_expand_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="sequential/mobilenetv2_1.00_160/block_4_expand_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_938, sequential/mobilenetv2_1.00_160/block_4_expand_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_4_expand_relu/Relu6:0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_947" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="124800" size="6912"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="GroupConvolution_1013" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1013, Reshape_947"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_1033" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="131712" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="sequential/mobilenetv2_1.00_160/block_4_depthwise_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1032, Reshape_1033, sequential/mobilenetv2_1.00_160/block_4_depthwise_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_4_depthwise_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="sequential/mobilenetv2_1.00_160/block_4_depthwise_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_1061, sequential/mobilenetv2_1.00_160/block_4_depthwise_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_4_depthwise_relu/Relu6:0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="sequential/mobilenetv2_1.00_160/block_4_project/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="132480" size="24576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_4_project/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_4_project/Conv2D_weights_fused_bn">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Convolution_1063" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1063"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_1083" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="157056" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="sequential/mobilenetv2_1.00_160/block_4_project_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1082, Reshape_1083, sequential/mobilenetv2_1.00_160/block_4_project_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_4_project_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="sequential/mobilenetv2_1.00_160/block_4_add/add:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_4_add/add:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_4_add/add:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="sequential/mobilenetv2_1.00_160/block_5_expand/Conv2D_weights_fused_bn" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="157184" size="24576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="sequential/mobilenetv2_1.00_160/block_5_expand/Conv2D_weights_fused_bn"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_5_expand/Conv2D_weights_fused_bn">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Convolution_1112" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1112"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_1132" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="181760" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="sequential/mobilenetv2_1.00_160/block_5_expand_BN/FusedBatchNormV3:0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_1131, Reshape_1132, sequential/mobilenetv2_1.00_160/block_5_expand_BN/FusedBatchNormV3:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_5_expand_BN/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="sequential/mobilenetv2_1.00_160/block_5_expand_relu/Relu6:0" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Maximum_1160, sequential/mobilenetv2_1.00_160/block_5_expand_relu/Relu6:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="sequential/mobilenetv2_1.00_160/block_5_expand_relu/Relu6:0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Reshape_1169" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="182528" size="6912"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="GroupConvolution_1235" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_1235, Reshape_1169"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_1255" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="189440" size="768"/>
			<output>
